Revit 2016 API
RebarConstraintsManager Members
The RebarConstraintsManager type exposes the following members.
Methods
Name | Description
ClearHandleConstraintPairHighlighting
 Clears all highlighting in all views.
Dispose
Releases all resources used by the RebarConstraintsManager
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConstrainedHandles
 Retrieves all handles on the Rebar that are constrained to external references.
GetConstraintCandidatesForHandle
 Returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.
GetCurrentConstraintOnHandle
 Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPreferredConstraintOnHandle
 Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasValidRebar
 Checks whether the Manager's Rebar is still valid.
HighlightHandleConstraintPairInAllViews
 Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
RemovePreferredConstraintFromHandle
 Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
SetPreferredConstraintForHandle
 Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace